SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_gpio.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_gpio.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/

#ifndef __N32G430_GPIO_H__
#define __N32G430_GPIO_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"


#define GPIOA_MODE_POSITION             (12U)
#define GPIOB_MODE_POSITION1            (3U)
#define GPIOB_MODE_POSITION2            (4U)
#define GPIOD_MODE_POSITION             (0U)

#define GPIOA_PUPD_POSITION1            (15U) 
#define GPIOA_PUPD_POSITION2            (13U)
#define GPIOA_PUPD_POSITION3            (14U)
#define GPIOB_PUPD_POSITION1            (4U)
#define GPIOD_PUPD_POSITION1            (0U)
#define GPIOD_PUPD_POSITION2            (12U)


#define GPIO_AF_MODE                    ((uint32_t)GPIO_PMODE0_2)
#define GPIO_ANALOG_MODE                ((uint32_t)GPIO_PMODE0_Msk)
#define GPIO_INPUT_MODE                 ((uint32_t)GPIO_PMODE0_0)
#define GPIO_PU_MODE                    ((uint32_t)GPIO_PUPD0_1)
#define GPIO_PD_MODE                    ((uint32_t)GPIO_PUPD0_2)
#define GPIO_DRIVER_8MA                 ((uint32_t)GPIO_DS1_1)
#define GPIO_SR_SLOW                    (GPIO_SR_SR0)

#define GPIO_OUTPUT_TYPE_MASK           ((uint32_t)0x00000010)
#define GPIO_SET_PMODE_MASK             ((uint32_t)0x00000003)
#define GPIO_AF_MASK                    ((uint32_t)0x0000000F)
#define AFIO_EXTI_CFG_MASK              ((uint32_t)0x0000003F)
#define AFIO_RMP_CFG_MASK               ((uint32_t)0x00000FFF)
#define GPIO_PMODE_MASK                 ((uint32_t)GPIO_PMODE0_Msk)
#define GPIO_PUPD_MASK                  ((uint32_t)GPIO_PUPD0_Msk)
#define GPIO_DRIVER_MASK                ((uint32_t)GPIO_DS0_Msk)
#define GPIO_POTYPE_MASK                (GPIO_POTYPE_POT0)
#define GPIO_SR_MASK                    (GPIO_SR_SR0)
#define GPIO_PLOCKK_MASK                (GPIO_PLOCK_PLOCKK)
#define AFIO_EXTI_POSITION_MASK         (0x03)
#define AFIO_EFT_SELECTION_MASK         ((uint8_t)0x02)
#define AFIO_RMPCFG_ADC_MASK            (0x01U)
#define AF_SELECTION_MASK               (0x08)
#define AF_WRITE_POSITION_MASK          (0x07U)
#define AFIO_EXTICFG_MASK               (0xFFUL)
#define AFIO_RMPCFG_EXTI_MASK           (0x0FU)
#define IO_POSITION_MASK                (1U)

#define MULTIPLIER_FACTOR_2             (2U)
#define MULTIPLIER_FACTOR_4             (4U)
#define MULTIPLIER_FACTOR_8             (8U)

#define SHIFT_EXTI                      (REG_BIT2_OFFSET)
#define SHIFT_POTYPE                    (REG_BIT4_OFFSET)
#define SHIFT_EXTI_ETRI                 (REG_BIT4_OFFSET)
#define SHIFT_PBSC_HIGH16               (REG_BIT16_OFFSET)

#define GPIO_GET_INDEX(PERIPH)          (((PERIPH) == (GPIOA))? 0 :\
                                         ((PERIPH) == (GPIOB))? 1 :\
                                         ((PERIPH) == (GPIOC))? 2 :3)

#define GPIO_GET_PERIPH(INDEX)          (((INDEX)==((uint8_t)0x00))? GPIOA :\
                                         ((INDEX)==((uint8_t)0x01))? GPIOB :\
                                         ((INDEX)==((uint8_t)0x02))? GPIOC : GPIOD )

/**
 *\*\name   GPIO_ModeType. 
 *\*\fun    GPIO mode definition.
 *\*\       Values convention: 0x00YZ
 *\*\          - Y  : Output type (Push Pull or Open Drain)
 *\*\          - Z  : IO Direction mode (Input, Output, Alternate or Analog)      
 */
#define GPIO_MODE_INPUT     ((uint32_t)0x00000000U)  /* Input Floating Mode */
#define GPIO_MODE_OUT_PP    ((uint32_t)0x00000001U)  /* Output Push Pull Mode */
#define GPIO_MODE_OUT_OD    ((uint32_t)0x00000011U)  /* Output Open Drain Mode */
#define GPIO_MODE_AF_PP     ((uint32_t)0x00000002U)  /* Alternate Function Push Pull Mode  */
#define GPIO_MODE_AF_OD     ((uint32_t)0x00000012U)  /* Alternate Function Open Drain Mode */
#define GPIO_MODE_ANALOG    ((uint32_t)0x00000003U)  /* Analog Mode */

/** GPIO Pull-Up or Pull-Down Activation **/
#define GPIO_NO_PULL         ((uint32_t)GPIO_PUPD0_0) /* No Pull-up or Pull-down activation */
#define GPIO_PULL_UP         ((uint32_t)GPIO_PUPD0_1) /* Pull-up activation */
#define GPIO_PULL_DOWN       ((uint32_t)GPIO_PUPD0_2) /* Pull-down activation */

/** slew rate config **/
#define GPIO_SLEW_RATE_FAST  ((uint32_t)0x00000000U)
#define GPIO_SLEW_RATE_SLOW  ((uint32_t)0x00000001U)

/** driver strength config **/
#define GPIO_DS_2MA          ((uint32_t)GPIO_DS0_0)
#define GPIO_DS_8MA          ((uint32_t)GPIO_DS0_1)
#define GPIO_DS_4MA          ((uint32_t)GPIO_DS0_2)
#define GPIO_DS_12MA         ((uint32_t)GPIO_DS0_3)

