SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_gpio.h
/** GPIO Init Structure Definition **/
typedef struct
{
    uint32_t         Pin;            /* Specifies the GPIO pins to be configured. */

    uint32_t         GPIO_Mode;      /* Specifies the operating mode for the selected pins. */

    uint32_t         GPIO_Pull;      /* Specifies the Pull-up or Pull-Down activation for the selected pins. */

    uint32_t         GPIO_Slew_Rate; /* Specify the reverse speed for the selected pins. */

    uint32_t         GPIO_Current;   /* Driving current of the select pins. */

    uint32_t         GPIO_Alternate; /* Peripheral to be connected to the selected pins. */ 
}GPIO_InitType;

/** Bit_SET and Bit_RESET enumeration **/
typedef enum
{
    PIN_RESET = 0,
    PIN_SET
}Bit_CommandType;

/** GPIO_pins_define **/
#define GPIO_PIN_0           ((uint16_t)0x0001U) /* Pin 0 selected    */
#define GPIO_PIN_1           ((uint16_t)0x0002U) /* Pin 1 selected    */
#define GPIO_PIN_2           ((uint16_t)0x0004U) /* Pin 2 selected    */
#define GPIO_PIN_3           ((uint16_t)0x0008U) /* Pin 3 selected    */
#define GPIO_PIN_4           ((uint16_t)0x0010U) /* Pin 4 selected    */
#define GPIO_PIN_5           ((uint16_t)0x0020U) /* Pin 5 selected    */
#define GPIO_PIN_6           ((uint16_t)0x0040U) /* Pin 6 selected    */
#define GPIO_PIN_7           ((uint16_t)0x0080U) /* Pin 7 selected    */
#define GPIO_PIN_8           ((uint16_t)0x0100U) /* Pin 8 selected    */
#define GPIO_PIN_9           ((uint16_t)0x0200U) /* Pin 9 selected    */
#define GPIO_PIN_10          ((uint16_t)0x0400U) /* Pin 10 selected   */
#define GPIO_PIN_11          ((uint16_t)0x0800U) /* Pin 11 selected   */
#define GPIO_PIN_12          ((uint16_t)0x1000U) /* Pin 12 selected   */
#define GPIO_PIN_13          ((uint16_t)0x2000U) /* Pin 13 selected   */
#define GPIO_PIN_14          ((uint16_t)0x4000U) /* Pin 14 selected   */
#define GPIO_PIN_15          ((uint16_t)0x8000U) /* Pin 15 selected   */
#define GPIO_PIN_ALL         ((uint16_t)0xFFFFU) /* All pins selected */

/** GPIO Port Sources **/
#define GPIOA_PORT_SOURCE    ((uint8_t)0x00)
#define GPIOB_PORT_SOURCE    ((uint8_t)0x01)
#define GPIOC_PORT_SOURCE    ((uint8_t)0x02)
#define GPIOD_PORT_SOURCE    ((uint8_t)0x03)

/** GPIO Pin Sources **/
#define GPIO_PIN_SOURCE0     ((uint8_t)0x00)
#define GPIO_PIN_SOURCE1     ((uint8_t)0x01)
#define GPIO_PIN_SOURCE2     ((uint8_t)0x02)
#define GPIO_PIN_SOURCE3     ((uint8_t)0x03)
#define GPIO_PIN_SOURCE4     ((uint8_t)0x04)
#define GPIO_PIN_SOURCE5     ((uint8_t)0x05)
#define GPIO_PIN_SOURCE6     ((uint8_t)0x06)
#define GPIO_PIN_SOURCE7     ((uint8_t)0x07)
#define GPIO_PIN_SOURCE8     ((uint8_t)0x08)
#define GPIO_PIN_SOURCE9     ((uint8_t)0x09)
#define GPIO_PIN_SOURCE10    ((uint8_t)0x0A)
#define GPIO_PIN_SOURCE11    ((uint8_t)0x0B)
#define GPIO_PIN_SOURCE12    ((uint8_t)0x0C)
#define GPIO_PIN_SOURCE13    ((uint8_t)0x0D)
#define GPIO_PIN_SOURCE14    ((uint8_t)0x0E)
#define GPIO_PIN_SOURCE15    ((uint8_t)0x0F)

/** EXTI external interrupt input source **/
#define AFIO_EXTI_PA0        (AFIO_EXTI_CFG1_EXTI0_PA0)
#define AFIO_EXTI_PB0        (AFIO_EXTI_CFG1_EXTI0_PB0)
#define AFIO_EXTI_PD0        (AFIO_EXTI_CFG1_EXTI0_PD0)
#define AFIO_EXTI_PA1        (AFIO_EXTI_CFG1_EXTI0_PA1)
#define AFIO_EXTI_PB1        (AFIO_EXTI_CFG1_EXTI0_PB1)
#define AFIO_EXTI_PA2        (AFIO_EXTI_CFG1_EXTI0_PA2)
#define AFIO_EXTI_PB2        (AFIO_EXTI_CFG1_EXTI0_PB2)
#define AFIO_EXTI_PA3        (AFIO_EXTI_CFG1_EXTI0_PA3)
#define AFIO_EXTI_PB3        (AFIO_EXTI_CFG1_EXTI0_PB3)

#define AFIO_EXTI_PA4        (AFIO_EXTI_CFG1_EXTI0_PA4)
#define AFIO_EXTI_PB4        (AFIO_EXTI_CFG1_EXTI0_PB4)
#define AFIO_EXTI_PA5        (AFIO_EXTI_CFG1_EXTI0_PA5)
#define AFIO_EXTI_PB5        (AFIO_EXTI_CFG1_EXTI0_PB5)
#define AFIO_EXTI_PA6        (AFIO_EXTI_CFG1_EXTI0_PA6)
#define AFIO_EXTI_PB6        (AFIO_EXTI_CFG1_EXTI0_PB6)
#define AFIO_EXTI_PA7        (AFIO_EXTI_CFG1_EXTI0_PA7)
#define AFIO_EXTI_PB7        (AFIO_EXTI_CFG1_EXTI0_PB7)

#define AFIO_EXTI_PA8        (AFIO_EXTI_CFG1_EXTI0_PA8)
#define AFIO_EXTI_PB8        (AFIO_EXTI_CFG1_EXTI0_PB8)
#define AFIO_EXTI_PA9        (AFIO_EXTI_CFG1_EXTI0_PA9)
#define AFIO_EXTI_PB9        (AFIO_EXTI_CFG1_EXTI0_PB9)
#define AFIO_EXTI_PA10       (AFIO_EXTI_CFG1_EXTI0_PA10)
#define AFIO_EXTI_PB10       (AFIO_EXTI_CFG1_EXTI0_PB10)
#define AFIO_EXTI_PA11       (AFIO_EXTI_CFG1_EXTI0_PA11)
#define AFIO_EXTI_PB11       (AFIO_EXTI_CFG1_EXTI0_PB11)

#define AFIO_EXTI_PA12       (AFIO_EXTI_CFG1_EXTI0_PA12)
#define AFIO_EXTI_PB12       (AFIO_EXTI_CFG1_EXTI0_PB12)
#define AFIO_EXTI_PD12       (AFIO_EXTI_CFG1_EXTI0_PD12)
#define AFIO_EXTI_PA13       (AFIO_EXTI_CFG1_EXTI0_PA13)
#define AFIO_EXTI_PB13       (AFIO_EXTI_CFG1_EXTI0_PB13)
#define AFIO_EXTI_PC13       (AFIO_EXTI_CFG1_EXTI0_PC13)
#define AFIO_EXTI_PD13       (AFIO_EXTI_CFG1_EXTI0_PD13)
#define AFIO_EXTI_PA14       (AFIO_EXTI_CFG1_EXTI0_PA14)
#define AFIO_EXTI_PB14       (AFIO_EXTI_CFG1_EXTI0_PB14)
#define AFIO_EXTI_PC14       (AFIO_EXTI_CFG1_EXTI0_PC14)
#define AFIO_EXTI_PD14       (AFIO_EXTI_CFG1_EXTI0_PD14)
#define AFIO_EXTI_PA15       (AFIO_EXTI_CFG1_EXTI0_PA15)
#define AFIO_EXTI_PB15       (AFIO_EXTI_CFG1_EXTI0_PB15)
#define AFIO_EXTI_PC15       (AFIO_EXTI_CFG1_EXTI0_PC15)
#define AFIO_EXTI_PD15       (AFIO_EXTI_CFG1_EXTI0_PD15)

/** EXTI line define **/
#define EXTI_LINE_0   ((uint16_t)0x0001U) /* EXTI0  */
#define EXTI_LINE_1   ((uint16_t)0x0002U) /* EXTI1  */
#define EXTI_LINE_2   ((uint16_t)0x0004U) /* EXTI2  */
#define EXTI_LINE_3   ((uint16_t)0x0008U) /* EXTI3  */
#define EXTI_LINE_4   ((uint16_t)0x0010U) /* EXTI4  */
#define EXTI_LINE_5   ((uint16_t)0x0020U) /* EXTI5  */
#define EXTI_LINE_6   ((uint16_t)0x0040U) /* EXTI6  */
#define EXTI_LINE_7   ((uint16_t)0x0080U) /* EXTI7  */
#define EXTI_LINE_8   ((uint16_t)0x0100U) /* EXTI8  */
#define EXTI_LINE_9   ((uint16_t)0x0200U) /* EXTI9  */
#define EXTI_LINE_10  ((uint16_t)0x0400U) /* EXTI10 */
#define EXTI_LINE_11  ((uint16_t)0x0800U) /* EXTI11 */
#define EXTI_LINE_12  ((uint16_t)0x1000U) /* EXTI12 */
#define EXTI_LINE_13  ((uint16_t)0x2000U) /* EXTI13 */
#define EXTI_LINE_14  ((uint16_t)0x4000U) /* EXTI14 */
#define EXTI_LINE_15  ((uint16_t)0x8000U) /* EXTI15 */
#define EXTI_LINE_ALL ((uint16_t)0xFFFFU) /* All EXTI line */

/** EXTI line sources **/
#define EXTI_LINE_SOURCE0    ((uint8_t)0x00) /* EXTI_line_0  */
#define EXTI_LINE_SOURCE1    ((uint8_t)0x01) /* EXTI_line_1  */
#define EXTI_LINE_SOURCE2    ((uint8_t)0x02) /* EXTI_line_2  */
#define EXTI_LINE_SOURCE3    ((uint8_t)0x03) /* EXTI_line_3  */
#define EXTI_LINE_SOURCE4    ((uint8_t)0x04) /* EXTI_line_4  */
#define EXTI_LINE_SOURCE5    ((uint8_t)0x05) /* EXTI_line_5  */
#define EXTI_LINE_SOURCE6    ((uint8_t)0x06) /* EXTI_line_6  */
#define EXTI_LINE_SOURCE7    ((uint8_t)0x07) /* EXTI_line_7  */
#define EXTI_LINE_SOURCE8    ((uint8_t)0x08) /* EXTI_line_8  */
#define EXTI_LINE_SOURCE9    ((uint8_t)0x09) /* EXTI_line_9  */
#define EXTI_LINE_SOURCE10   ((uint8_t)0x0A) /* EXTI_line_10 */
#define EXTI_LINE_SOURCE11   ((uint8_t)0x0B) /* EXTI_line_11 */
#define EXTI_LINE_SOURCE12   ((uint8_t)0x0C) /* EXTI_line_12 */
#define EXTI_LINE_SOURCE13   ((uint8_t)0x0D) /* EXTI_line_13 */
#define EXTI_LINE_SOURCE14   ((uint8_t)0x0E) /* EXTI_line_14 */
#define EXTI_LINE_SOURCE15   ((uint8_t)0x0F) /* EXTI_line_15 */

/** Filter stage control define **/
#define AFIO_IOFITCFG        ((uint8_t)0x00)

