SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_gpio.h
/** AFIO EFT sources **/
#define AFIO_PA0_EFT         (AFIO_EFT_CFG1_PA0EFTEN)      
#define AFIO_PA1_EFT         (AFIO_EFT_CFG1_PA1EFTEN)   
#define AFIO_PA2_EFT         (AFIO_EFT_CFG1_PA2EFTEN)   
#define AFIO_PA3_EFT         (AFIO_EFT_CFG1_PA3EFTEN)    
#define AFIO_PA4_EFT         (AFIO_EFT_CFG1_PA4EFTEN)    
#define AFIO_PA5_EFT         (AFIO_EFT_CFG1_PA5EFTEN)    
#define AFIO_PA6_EFT         (AFIO_EFT_CFG1_PA6EFTEN)    
#define AFIO_PA7_EFT         (AFIO_EFT_CFG1_PA7EFTEN)    
#define AFIO_PA8_EFT         (AFIO_EFT_CFG1_PA8EFTEN)    
#define AFIO_PA9_EFT         (AFIO_EFT_CFG1_PA9EFTEN)      
#define AFIO_PA10_EFT        (AFIO_EFT_CFG1_PA10EFTEN)    
#define AFIO_PA11_EFT        (AFIO_EFT_CFG1_PA11EFTEN)    
#define AFIO_PA12_EFT        (AFIO_EFT_CFG1_PA12EFTEN)    
#define AFIO_PA13_EFT        (AFIO_EFT_CFG1_PA13EFTEN)    
#define AFIO_PA14_EFT        (AFIO_EFT_CFG1_PA14EFTEN)   
#define AFIO_PA15_EFT        (AFIO_EFT_CFG1_PA15EFTEN) 
#define AFIO_PB0_EFT         (AFIO_EFT_CFG1_PB0EFTEN)     
#define AFIO_PB1_EFT         (AFIO_EFT_CFG1_PB1EFTEN)   
#define AFIO_PB2_EFT         (AFIO_EFT_CFG1_PB2EFTEN)   
#define AFIO_PB3_EFT         (AFIO_EFT_CFG1_PB3EFTEN)   
#define AFIO_PB4_EFT         (AFIO_EFT_CFG1_PB4EFTEN)   
#define AFIO_PB5_EFT         (AFIO_EFT_CFG1_PB5EFTEN)    
#define AFIO_PB6_EFT         (AFIO_EFT_CFG1_PB6EFTEN)    
#define AFIO_PB7_EFT         (AFIO_EFT_CFG1_PB7EFTEN)   
#define AFIO_PB8_EFT         (AFIO_EFT_CFG1_PB8EFTEN)    
#define AFIO_PB9_EFT         (AFIO_EFT_CFG1_PB9EFTEN)   
#define AFIO_PB10_EFT        (AFIO_EFT_CFG1_PB10EFTEN)    
#define AFIO_PB11_EFT        (AFIO_EFT_CFG1_PB11EFTEN)   
#define AFIO_PB12_EFT        (AFIO_EFT_CFG1_PB12EFTEN)    
#define AFIO_PB13_EFT        (AFIO_EFT_CFG1_PB13EFTEN)   
#define AFIO_PB14_EFT        (AFIO_EFT_CFG1_PB14EFTEN)    
#define AFIO_PB15_EFT        (AFIO_EFT_CFG1_PB15EFTEN)  
#define AFIO_PC13_EFT        (AFIO_EFT_CFG2_PC13EFTEN)    
#define AFIO_PC14_EFT        (AFIO_EFT_CFG2_PC14EFTEN)    
#define AFIO_PC15_EFT        (AFIO_EFT_CFG2_PC15EFTEN)    
#define AFIO_PD0_EFT         (AFIO_EFT_CFG2_PD0EFTEN)    
#define AFIO_PD12_EFT        (AFIO_EFT_CFG2_PD12EFTEN)   
#define AFIO_PD13_EFT        (AFIO_EFT_CFG2_PD13EFTEN)    
#define AFIO_PD14_EFT        (AFIO_EFT_CFG2_PD14EFTEN)    
#define AFIO_PD15_EFT        (AFIO_EFT_CFG2_PD15EFTEN)  

/** AFIO DIGEFT sources **/
#define AFIO_PA0_DIGEFT      (AFIO_DIGEFT_CFG1_PA0EFTEN)       
#define AFIO_PA1_DIGEFT      (AFIO_DIGEFT_CFG1_PA1EFTEN)    
#define AFIO_PA2_DIGEFT      (AFIO_DIGEFT_CFG1_PA2EFTEN)    
#define AFIO_PA3_DIGEFT      (AFIO_DIGEFT_CFG1_PA3EFTEN)     
#define AFIO_PA4_DIGEFT      (AFIO_DIGEFT_CFG1_PA4EFTEN)     
#define AFIO_PA5_DIGEFT      (AFIO_DIGEFT_CFG1_PA5EFTEN)     
#define AFIO_PA6_DIGEFT      (AFIO_DIGEFT_CFG1_PA6EFTEN)     
#define AFIO_PA7_DIGEFT      (AFIO_DIGEFT_CFG1_PA7EFTEN)     
#define AFIO_PA8_DIGEFT      (AFIO_DIGEFT_CFG1_PA8EFTEN)     
#define AFIO_PA9_DIGEFT      (AFIO_DIGEFT_CFG1_PA9EFTEN)       
#define AFIO_PA10_DIGEFT     (AFIO_DIGEFT_CFG1_PA10EFTEN)    
#define AFIO_PA11_DIGEFT     (AFIO_DIGEFT_CFG1_PA11EFTEN)    
#define AFIO_PA12_DIGEFT     (AFIO_DIGEFT_CFG1_PA12EFTEN)    
#define AFIO_PA13_DIGEFT     (AFIO_DIGEFT_CFG1_PA13EFTEN)    
#define AFIO_PA14_DIGEFT     (AFIO_DIGEFT_CFG1_PA14EFTEN)   
#define AFIO_PA15_DIGEFT     (AFIO_DIGEFT_CFG1_PA15EFTEN) 
#define AFIO_PB0_DIGEFT      (AFIO_DIGEFT_CFG1_PB0EFTEN)      
#define AFIO_PB1_DIGEFT      (AFIO_DIGEFT_CFG1_PB1EFTEN)    
#define AFIO_PB2_DIGEFT      (AFIO_DIGEFT_CFG1_PB2EFTEN)    
#define AFIO_PB3_DIGEFT      (AFIO_DIGEFT_CFG1_PB3EFTEN)    
#define AFIO_PB4_DIGEFT      (AFIO_DIGEFT_CFG1_PB4EFTEN)    
#define AFIO_PB5_DIGEFT      (AFIO_DIGEFT_CFG1_PB5EFTEN)     
#define AFIO_PB6_DIGEFT      (AFIO_DIGEFT_CFG1_PB6EFTEN)     
#define AFIO_PB7_DIGEFT      (AFIO_DIGEFT_CFG1_PB7EFTEN)    
#define AFIO_PB8_DIGEFT      (AFIO_DIGEFT_CFG1_PB8EFTEN)     
#define AFIO_PB9_DIGEFT      (AFIO_DIGEFT_CFG1_PB9EFTEN)    
#define AFIO_PB10_DIGEFT     (AFIO_DIGEFT_CFG1_PB10EFTEN)    
#define AFIO_PB11_DIGEFT     (AFIO_DIGEFT_CFG1_PB11EFTEN)   
#define AFIO_PB12_DIGEFT     (AFIO_DIGEFT_CFG1_PB12EFTEN)    
#define AFIO_PB13_DIGEFT     (AFIO_DIGEFT_CFG1_PB13EFTEN)   
#define AFIO_PB14_DIGEFT     (AFIO_DIGEFT_CFG1_PB14EFTEN)    
#define AFIO_PB15_DIGEFT     (AFIO_DIGEFT_CFG1_PB15EFTEN)  
#define AFIO_PC13_DIGEFT     (AFIO_DIGEFT_CFG2_PC13EFTEN)    
#define AFIO_PC14_DIGEFT     (AFIO_DIGEFT_CFG2_PC14EFTEN)    
#define AFIO_PC15_DIGEFT     (AFIO_DIGEFT_CFG2_PC15EFTEN)    
#define AFIO_PD0_DIGEFT      (AFIO_DIGEFT_CFG2_PD0EFTEN)     
#define AFIO_PD12_DIGEFT     (AFIO_DIGEFT_CFG2_PD12EFTEN)   
#define AFIO_PD13_DIGEFT     (AFIO_DIGEFT_CFG2_PD13EFTEN)    
#define AFIO_PD14_DIGEFT     (AFIO_DIGEFT_CFG2_PD14EFTEN)    
#define AFIO_PD15_DIGEFT     (AFIO_DIGEFT_CFG2_PD15EFTEN)  


/** Port pin 5V tolerance enable mask **/
#define PA0_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA0TOLENN)
#define PA1_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA1TOLENN)
#define PA2_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA2TOLENN)
#define PA3_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA3TOLENN)
#define PA4_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA4TOLENN)
#define PA5_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA5TOLENN)
#define PA6_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA6TOLENN)
#define PA7_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA7TOLENN)
#define PA8_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA8TOLENN)
#define PA11_5V_TOLERANCE    (AFIO_5VTOL_CFG_PA11TOLENN)
#define PA12_5V_TOLERANCE    (AFIO_5VTOL_CFG_PA12TOLENN)
#define PA15_5V_TOLERANCE    (AFIO_5VTOL_CFG_PA15TOLENN)
#define PB0_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB0TOLENN)
#define PB1_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB1TOLENN)
#define PB2_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB2TOLENN)
#define PB3_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB3TOLENN)
#define PB4_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB4TOLENN)
#define PB5_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB5TOLENN)
#define PB7_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB7TOLENN)
#define PB10_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB10TOLENN)
#define PB11_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB11TOLENN)
#define PB12_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB12TOLENN)
#define PB13_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB13TOLENN)
#define PB14_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB14TOLENN)
#define PB15_5V_TOLERANCE    (AFIO_5VTOL_CFG_PB15TOLENN)

/** GPIOx_Alternate_function_selection Alternate function selection **/

/** Alternate function AF0 **/
#define ALTERNATE_FUN_0      ((uint8_t)0x00U)
#define GPIO_AF0_SWDIO_JTMS  (ALTERNATE_FUN_0) /* SWDIO Alternate Function mapping    */
#define GPIO_AF0_SWCLK_JTCK  (ALTERNATE_FUN_0) /* SWCLK Alternate Function mapping    */
#define GPIO_AF0_JTDI        (ALTERNATE_FUN_0) /* JTDI  Alternate Function mapping    */
#define GPIO_AF0_JTDO        (ALTERNATE_FUN_0) /* JTDO  Alternate Function mapping    */
#define GPIO_AF0_NJRST       (ALTERNATE_FUN_0) /* NJRST Alternate Function mapping    */

/** Alternate function AF1 **/
#define ALTERNATE_FUN_1      ((uint8_t)0x01U)
#define GPIO_AF1_SPI1        (ALTERNATE_FUN_1) /* SPI1 Alternate Function mapping     */
#define GPIO_AF1_SPI2        (ALTERNATE_FUN_1) /* SPI2 Alternate Function mapping     */
#define GPIO_AF1_TIM8        (ALTERNATE_FUN_1) /* TIM8 Alternate Function mapping     */
#define GPIO_AF1_USART1      (ALTERNATE_FUN_1) /* USART1 Alternate Function mapping   */

/** Alternate function AF2 **/
#define ALTERNATE_FUN_2      ((uint8_t)0x02U)
#define GPIO_AF2_TIM5        (ALTERNATE_FUN_2) /* TIM5 Alternate Function mapping     */
#define GPIO_AF2_TIM1        (ALTERNATE_FUN_2) /* TIM1 Alternate Function mapping     */
#define GPIO_AF2_USART1      (ALTERNATE_FUN_2) /* USART1 Alternate Function mapping   */
#define GPIO_AF2_I2C2        (ALTERNATE_FUN_2) /* I2C2 Alternate Function mapping     */
#define GPIO_AF2_CAN         (ALTERNATE_FUN_2) /* CAN Alternate Function mapping      */
#define GPIO_AF2_SPI2        (ALTERNATE_FUN_2) /* SPI2 Alternate Function mapping     */
#define GPIO_AF2_SPI1        (ALTERNATE_FUN_2) /* SPI1 Alternate Function mapping     */
#define GPIO_AF2_I2C1        (ALTERNATE_FUN_2) /* I2C1 Alternate Function mapping     */

/** Alternate function AF3 **/
#define ALTERNATE_FUN_3      ((uint8_t)0x03U)
#define GPIO_AF3_TIM2        (ALTERNATE_FUN_3) /* TIM2 Alternate Function mapping     */
#define GPIO_AF3_SPI2        (ALTERNATE_FUN_3) /* SPI2 Alternate Function mapping     */
#define GPIO_AF3_TIM3        (ALTERNATE_FUN_3) /* TIM3 Alternate Function mapping     */
#define GPIO_AF3_TIM1        (ALTERNATE_FUN_3) /* TIM1 Alternate Function mapping     */
#define GPIO_AF3_LPTIM       (ALTERNATE_FUN_3) /* LPTIM Alternate Function mapping    */
#define GPIO_AF3_TIM4        (ALTERNATE_FUN_3) /* TIM4 Alternate Function mapping     */

/** Alternate function AF4 **/
#define ALTERNATE_FUN_4      ((uint8_t)0x04U)
#define GPIO_AF4_EVENTOUT    (ALTERNATE_FUN_4) /* EVENTOUT Alternate Function mapping */
#define GPIO_AF4_USART2      (ALTERNATE_FUN_4) /* USART2 Alternate Function mapping   */

/** Alternate function AF5 **/
#define ALTERNATE_FUN_5      ((uint8_t)0x05U)
#define GPIO_AF5_USART2      (ALTERNATE_FUN_5) /* USART2 Alternate Function mapping   */
#define GPIO_AF5_USART1      (ALTERNATE_FUN_5) /* USART1 Alternate Function mapping   */
#define GPIO_AF5_SPI1        (ALTERNATE_FUN_5) /* SPI1 Alternate Function mapping     */
#define GPIO_AF5_TIM3        (ALTERNATE_FUN_5) /* TIM3 Alternate Function mapping     */
#define GPIO_AF5_SPI2        (ALTERNATE_FUN_5) /* SPI2 Alternate Function mapping     */
#define GPIO_AF5_I2C1        (ALTERNATE_FUN_5) /* I2C1 Alternate Function mapping     */

/** Alternate function AF6 **/
#define ALTERNATE_FUN_6      ((uint8_t)0x06U)
#define GPIO_AF6_TIM2        (ALTERNATE_FUN_6) /* TIM2 Alternate Function mapping     */
#define GPIO_AF6_I2C2        (ALTERNATE_FUN_6) /* I2C2 Alternate Function mapping     */
#define GPIO_AF6_TIM4        (ALTERNATE_FUN_6) /* TIM4 Alternate Function mapping     */
#define GPIO_AF6_TIM1        (ALTERNATE_FUN_6) /* TIM1 Alternate Function mapping     */
#define GPIO_AF6_SPI1        (ALTERNATE_FUN_6) /* SPI1 Alternate Function mapping     */
#define GPIO_AF6_SPI2        (ALTERNATE_FUN_6) /* SPI2 Alternate Function mapping     */
#define GPIO_AF6_LPTIM       (ALTERNATE_FUN_6) /* LPTIM Alternate Function mapping    */
#define GPIO_AF6_CAN         (ALTERNATE_FUN_6) /* CAN Alternate Function mapping      */
#define GPIO_AF6_UART4       (ALTERNATE_FUN_6) /* UART4 Alternate Function mapping    */

/** Alternate function AF7 **/
#define ALTERNATE_FUN_7      ((uint8_t)0x07U)
#define GPIO_AF7_TIM5        (ALTERNATE_FUN_7) /* TIM5 Alternate Function mapping     */
#define GPIO_AF7_TIM8        (ALTERNATE_FUN_7) /* TIM8 Alternate Function mapping     */
#define GPIO_AF7_I2C2        (ALTERNATE_FUN_7) /* I2C2 Alternate Function mapping     */
#define GPIO_AF7_USART2      (ALTERNATE_FUN_7) /* USART2 Alternate Function mapping   */
#define GPIO_AF7_UART4       (ALTERNATE_FUN_7) /* UART4 Alternate Function mapping    */
#define GPIO_AF7_UART3       (ALTERNATE_FUN_7) /* UART3 Alternate Function mapping    */
#define GPIO_AF7_TIM1        (ALTERNATE_FUN_7) /* TIM1 Alternate Function mapping     */
#define GPIO_AF7_I2C1        (ALTERNATE_FUN_7) /* I2C1 Alternate Function mapping     */

