SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_gpio.h
/** Alternate function AF8 **/
#define ALTERNATE_FUN_8      ((uint8_t)0x08U)
#define GPIO_AF8_TIM8        (ALTERNATE_FUN_8) /* TIM8 Alternate Function mapping     */
#define GPIO_AF8_TIM5        (ALTERNATE_FUN_8) /* TIM5 Alternate Function mapping     */
#define GPIO_AF8_COMP2       (ALTERNATE_FUN_8) /* COMP2 Alternate Function mapping    */
#define GPIO_AF8_I2C1        (ALTERNATE_FUN_8) /* I2C1 Alternate Function mapping     */
#define GPIO_AF8_TIM1        (ALTERNATE_FUN_8) /* TIM1 Alternate Function mapping     */
#define GPIO_AF8_COMP1       (ALTERNATE_FUN_8) /* COMP1 Alternate Function mapping    */
#define GPIO_AF8_UART3       (ALTERNATE_FUN_8) /* UART3 Alternate Function mapping    */

/** Alternate function AF9 **/
#define ALTERNATE_FUN_9      ((uint8_t)0x09U)
#define GPIO_AF9_COMP1       (ALTERNATE_FUN_9) /* COMP1 Alternate Function mapping    */
#define GPIO_AF9_TIM8        (ALTERNATE_FUN_9) /* TIM8 Alternate Function mapping     */
#define GPIO_AF9_TIM4        (ALTERNATE_FUN_9) /* TIM4 Alternate Function mapping     */
#define GPIO_AF9_MCO         (ALTERNATE_FUN_9) /* MCO Alternate Function mapping      */
#define GPIO_AF9_RTC         (ALTERNATE_FUN_9) /* RTC Alternate Function mapping      */
#define GPIO_AF9_COMP2       (ALTERNATE_FUN_9) /* COMP2 Alternate Function mapping    */
#define GPIO_AF9_LPTIM       (ALTERNATE_FUN_9) /* LPTIM Alternate Function mapping    */
#define GPIO_AF9_I2C2        (ALTERNATE_FUN_9) /* I2C2 Alternate Function mapping     */
#define GPIO_AF9_TIMESTAMP   (ALTERNATE_FUN_9) /* TIMESTAMP Alternate Function mapping */

/** Alternate function AF10 **/
#define ALTERNATE_FUN_10     ((uint8_t)0x0AU)
#define GPIO_AF10_TIM1       (ALTERNATE_FUN_10) /* TIM1 Alternate Function mapping     */
#define GPIO_AF10_TIM8       (ALTERNATE_FUN_10) /* TIM8 Alternate Function mapping     */
#define GPIO_AF10_COMP3      (ALTERNATE_FUN_10) /* COMP3 Alternate Function mapping    */
#define GPIO_AF10_TIM4       (ALTERNATE_FUN_10) /* TIM4 Alternate Function mapping     */
#define GPIO_AF10_COMP1      (ALTERNATE_FUN_10) /* COMP1 Alternate Function mapping    */
#define GPIO_AF10_UART3      (ALTERNATE_FUN_10) /* UART3 Alternate Function mapping    */

/** Alternate function AF11 **/
#define ALTERNATE_FUN_11     ((uint8_t)0x0BU)
#define GPIO_AF11_UART4      (ALTERNATE_FUN_11) /* UART4 Alternate Function mapping    */
#define GPIO_AF11_CAN        (ALTERNATE_FUN_11) /* CAN Alternate Function mapping      */
#define GPIO_AF11_USART2     (ALTERNATE_FUN_11) /* USART2 Alternate Function mapping   */
#define GPIO_AF11_TIM8       (ALTERNATE_FUN_11) /* TIM8 Alternate Function mapping     */
#define GPIO_AF11_COMP3      (ALTERNATE_FUN_11) /* COMP3 Alternate Function mapping    */

/** Alternate function AF12 **/
#define ALTERNATE_FUN_12     ((uint8_t)0x0CU)
#define GPIO_AF12_LPTIM      (ALTERNATE_FUN_12) /* LPTIM Alternate Function mapping    */
#define GPIO_AF12_BEEPER     (ALTERNATE_FUN_12) /* BEEPER Alternate Function mapping   */

/** Alternate function AF13 **/
#define ALTERNATE_FUN_13     ((uint8_t)0x0DU)
#define GPIO_AF13_TIM3       (ALTERNATE_FUN_13) /* TIM3 Alternate Function mapping     */
#define GPIO_AF13_TIM8       (ALTERNATE_FUN_13) /* TIM8 Alternate Function mapping     */
#define GPIO_AF13_TIM4       (ALTERNATE_FUN_13) /* TIM4 Alternate Function mapping     */
#define GPIO_AF13_TIM5       (ALTERNATE_FUN_13) /* TIM5 Alternate Function mapping     */

/** Alternate function AF15 **/
#define ALTERNATE_FUN_15     ((uint8_t)0x0FU)  /* NON Alternate Function mapping     */

#define GPIO_NO_AF           (ALTERNATE_FUN_15)

/** SPI mode definition in AFIO register  **/
#define AFIO_SPI1_NSS        ((uint32_t)AFIO_RMP_CFG_SPI1_NSS)
#define AFIO_SPI2_NSS        ((uint32_t)AFIO_RMP_CFG_SPI2_NSS)

#define AFIO_SPI_NSS_HIGH_IMPEDANCE  (0x0UL)
#define AFIO_SPI_NSS_High_LEVEL      (0x1UL)

/** ADC mode definition in AFIO register  **/
typedef enum
{
    AFIO_ADC_ETRI = 9U,
    AFIO_ADC_ETRR = 8U
}AFIO_ADC_ETRType;

typedef enum
{
    AFIO_ADC_TRIG_EXTI_0 = 0x00U,
    AFIO_ADC_TRIG_EXTI_1 = 0x01U,
    AFIO_ADC_TRIG_EXTI_2,
    AFIO_ADC_TRIG_EXTI_3,
    AFIO_ADC_TRIG_EXTI_4,
    AFIO_ADC_TRIG_EXTI_5,
    AFIO_ADC_TRIG_EXTI_6,
    AFIO_ADC_TRIG_EXTI_7,
    AFIO_ADC_TRIG_EXTI_8,
    AFIO_ADC_TRIG_EXTI_9,
    AFIO_ADC_TRIG_EXTI_10,
    AFIO_ADC_TRIG_EXTI_11,
    AFIO_ADC_TRIG_EXTI_12,
    AFIO_ADC_TRIG_EXTI_13,
    AFIO_ADC_TRIG_EXTI_14,
    AFIO_ADC_TRIG_EXTI_15,
    AFIO_ADC_TRIG_TIM8_TRGO,
    AFIO_ADC_TRIG_TIM8_CH4
}AFIO_ADC_Trig_RemapType;



/** GPIO_Exported_Functions **/
void GPIOA_Pin_Reset(uint16_t pin);
void GPIOB_Pin_Reset(uint16_t pin);
void GPIOC_Pin_Reset(uint16_t pin);
void GPIOD_Pin_Reset(uint16_t pin);
void AFIO_EXTI_Reset(uint16_t EXTI_line);
void GPIO_ALLPin_Reset(void);

void GPIO_Reset(GPIO_Module* GPIOx);
void GPIO_Alternate_Function_Reset(void);

void GPIO_Alternate_Set(GPIO_Module* GPIOx, uint32_t alternate, uint32_t position);
void GPIO_Mode_Set(GPIO_Module* GPIOx, uint32_t mode, uint32_t position);
void GPIO_Pull_Set(GPIO_Module* GPIOx, uint32_t pull, uint32_t position);
void GPIO_SlewRate_Set(GPIO_Module* GPIOx, uint32_t slew_rate, uint32_t position);
void GPIO_Driver_Set(GPIO_Module* GPIOx, uint32_t current, uint32_t position);
void GPIO_Peripheral_Initialize(GPIO_Module* GPIOx, GPIO_InitType* GPIO_InitStructure);
void GPIO_Structure_Initialize(GPIO_InitType* GPIO_InitStruct);

uint8_t GPIO_Input_Pin_Data_Get(GPIO_Module* GPIOx, uint16_t pin);
uint16_t GPIO_Input_Data_Get(GPIO_Module* GPIOx);
uint8_t GPIO_Output_Pin_Data_Get(GPIO_Module* GPIOx, uint16_t pin);
uint16_t GPIO_Output_Data_Get(GPIO_Module* GPIOx);
void GPIO_Pins_Set(GPIO_Module* GPIOx, uint16_t pin);
void GPIO_Pins_Reset(GPIO_Module* GPIOx, uint16_t pin);
void GPIO_PBSC_Pins_Reset(GPIO_Module* GPIOx, uint16_t pin);
void GPIO_PBC_Pins_Reset(GPIO_Module* GPIOx, uint16_t pin);
void GPIO_Write(GPIO_Module* GPIOx, uint16_t data_value);
void GPIO_Pin_Toggle(GPIO_Module* GPIOx, uint16_t pin);
void GPIO_Pin_Lock_Set(GPIO_Module* GPIOx, uint16_t pin);

void GPIO_Pin_Remap_Set(uint8_t port_source, uint8_t pin_source, uint32_t alternate_function);
void GPIO_EXTI_Line_Set(uint8_t EXTI_line, uint32_t pin_source);
void AFIO_SPI_NSS_Mode_Set(uint32_t AFIO_SPIx_NSS, uint32_t SPI_nss_mode);
void AFIO_ADC_External_Trigger_Remap_Set(AFIO_ADC_ETRType ADC_ET_type, AFIO_ADC_Trig_RemapType ADC_trigger_remap);

void AFIO_5V_Tolerance_Enable(uint32_t tol_pin);
void AFIO_5V_Tolerance_Disable(uint32_t tol_pin);
void AFIO_Filter_Stage_Ctrl(uint8_t filter);
void AFIO_EFT_Enable(GPIO_Module* GPIOx, uint32_t EFT_pin_source);
void AFIO_EFT_Disable(GPIO_Module* GPIOx, uint32_t EFT_pin_source);
void AFIO_Digital_EFT_Enable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin);
void AFIO_Digital_EFT_Disable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin);


#ifdef __cplusplus
}
#endif

#endif /* __N32G430_GPIO_H__ */

